blog/2021/solve-garbled-problem.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-09 Wed 12:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>解决 Windows 下中文文件在 Linux 中读取乱码的问题</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">解决 Windows 下中文文件在 Linux 中读取乱码的问题</h1>
</header><p>
<a href="https://wiki.archlinux.org/title/Localization/Simplified_Chinese#Garbled_problem">Garbled problem - Localization/Simplified Chinese - ArchWiki</a>
</p>

<p>
Windows 系统下创建的文件采用的编码标准可能是 gbk/gb2312。所以避免乱码的基本原则就是使用包含字符更多的 utf-8，避免使用其他编码格式。
</p>

<div id="outline-container-orgfde01d1" class="outline-2">
<h2 id="orgfde01d1">文件名乱码</h2>
<div class="outline-text-2" id="text-orgfde01d1">
<p>
安装 <a href="https://linux.die.net/man/1/convmv">convmv</a>，使用 <code>convmv</code> 命令转换编码格式。举例：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ convmv -f GBK -t UTF-8 --notest --nosmart file
</pre>
</div>
</div>
</div>

<div id="outline-container-org2404b96" class="outline-2">
<h2 id="org2404b96">文件内容乱码</h2>
<div class="outline-text-2" id="text-org2404b96">
<p>
使用 <code>iconv</code> 命令转换格式：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ iconv -f GBK -t UTF-8 -o new-file origin-file
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfeb79de" class="outline-2">
<h2 id="orgfeb79de">zip 压缩包乱码</h2>
<div class="outline-text-2" id="text-orgfeb79de">
<p>
在非 utf8 编码环境(通常是 Windows 下的中文环境)下，不要使用 zip 进行压缩(建议使用 7z)。需要一个特殊的参数：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ unzip -O gbk file.zip
</pre>
</div>
</div>
</div>
</div>
</body>
</html>